{"authors": ["Katherine Koretski"], "date_download": "2024-08-09 13:37:00", "date_modify": "None", "date_publish": "2024-08-24 00:00:00", "description": "Robert F. Kennedy Jr.’s independent presidential campaign is disappearing — both on the trail and in the polls.", "filename": "https%3A%2F%2Fwww.nbcnews.com%2Fpolitics%2F2024-election%2Frfk-jrs-incredible-disappearing-campaign-rcna164873.json", "image_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-08/240802-Robert-F-Kennedy-jr-al-1113-3b96d4.jpg", "language": "en", "localpath": null, "maintext": "Robert F. Kennedy Jr.’s independent presidential campaign is disappearing — both on the trail and in the polls.\nThe last public event put on by Kennedy was in Freeport, Maine, on July 9. Kennedy has since spoken virtually and appeared at a cryptocurrency conference and events put on by others, but he hasn't been stumping on the campaign trail. (He did speak in person with reporters the day President Joe Biden dropped out of the race.) And it’s been months since his running mate, Nicole Shanahan, has had a public event on the campaign trail.\nKennedy’s public poll numbers are dropping, from around 9% or 10% in national surveys before Biden dropped out, to about half that level now. His last financial report showed the campaign carrying debt equal to more than half of the $5.6 million it had in the bank. On a media call last week, Kennedy said Democrats and Republicans colluded to make it “insurmountable” for an independent to get on the ballot in all 50 states — which he and his campaign had previously talked about as a matter of when, not if.\nAnd when Kennedy has been in the public spotlight of late, it’s been for bad reasons. Vanity Fair in July reported that Kennedy groped a former family babysitter, Eliza Cooney, in 1999. Kennedy sent text messages to Cooney days after the article’s release, apologizing yet saying he had “no memory of the incident.”\nKennedy also revealed, before the publication of a New Yorker profile that included the story, his bizarre decision years ago to pick up a dead bear on a roadside and then stage a bicycle accident scene with it in New York’s Central Park.\nAltogether, the campaign is getting worse, not better, for Kennedy, raising questions about just how much impact he’ll have on the 2024 election. Vice President Kamala Harris’ takeover of the Democratic nomination appears to have sapped some of Kennedy’s appeal to disaffected voters, and he has recently spoken warmly about Trump and spoken to him directly several times. Kennedy said he thinks Trump is “likely to be the next president” during a livestreamed event last week ahead of his keynote address at the Bitcoin Conference.\nThe Kennedy campaign did not respond to questions for this article.\nThe Bitcoin Conference appearance was typical of Kennedy’s recent schedule. He has been holding virtual events and spoken at different conferences put on by entities other than his campaign, like the Inman Connect conference in Las Vegas. Kennedy has not publicly announced upcoming rallies on his website.\nKennedy also canceled an appearance set for Saturday at the Iowa State Fair, citing security concerns. A spokesperson for the campaign told NBC News that it was “unable to secure a venue stage indoors to satisfy our security requirements for Mr. Kennedy’s safety.”\nKennedy got Secret Service protection following the assassination attempt against Trump in mid-July.\nThat was one of several events, along with Biden’s departure as a 2024 foil, that changed the campaign as Kennedy faded into the background. Kennedy was set to spend the entire week of the Republican National Convention campaigning in battleground Wisconsin. Those events were canceled, though, as Kennedy instead met and spoke with Trump that week.\nOn the morning of July 16, during the convention, Kennedy’s son Bobby Kennedy III posted video on X of his father’s call with Trump, in which they discussed vaccines and children. Trump could also be heard telling Kennedy, “I would love you to do stuff — and I think it’d be so good for you and so big for you.”\nThe video was deleted soon after it was posted. The Kennedy and Trump campaigns have not commented or provided any details about whether Trump made Kennedy a specific offer.\nMeanwhile, some high-profile supporters have left Kennedy in recent months. Lori Spencer, a longtime supporter of Kennedy, posted on X shortly after the Vanity Fair article was released saying that she “absolutely cannot and will not defend this behavior.”\nWhen Kennedy was asked if other women might come forward with stories about him behaving inappropriately, Kennedy told The Boston Globe, “I don’t know. We’ll see what happens.”\nHe has also gained some supporters in recent weeks. Kennedy posted a video on Aug. 2 announcing an endorsement from Russell Brand, the actor and comedian who has been accused of sexual assault by multiple women. Podcast host Joe Rogan also declared himself \"a fan\" of Kennedy on his show, which has a large audience.\nMost recently, Kennedy’s time has been taken up by a New York trial over his efforts to gain ballot access in the state. A Democratic-aligned group is suing Kennedy over the address he claimed as his residence on ballot access petition forms. Kennedy currently resides in California with his wife, actor Cheryl Hines, but during testimony he said the couple had always intended to move back to New York.\nIf the judge rules against Kennedy, he could be disqualified from appearing on New York state ballots in November. That would make it the first state so far where Kennedy failed to get on the general election ballot.\n“Whatever this court does, we’re going to win the appeal,” Kennedy told reporters on Wednesday.", "source_domain": "www.nbcnews.com", "text": null, "title": "RFK Jr.'s incredible disappearing campaign", "title_page": null, "title_rss": null, "url": "https://www.nbcnews.com/politics/2024-election/rfk-jrs-incredible-disappearing-campaign-rcna164873"}